// 설정 파일
const CONFIG = {
    GITHUB_USERNAME: 'wook-dragon',
    REPO_NAME: 'weryechurch',
    FOLDER_NAME: 'static/songs',

    // [중요] 비상용 하드코딩 리스트 (API 오류 시 사용)
    FALLBACK_SONGS: [
        "2월_생일송_예꿈유년부.mp3",
        "3월_생일송_예꿈유년부.mp3",
        "가장특별해.mp3",
        "내 안에 부어주소서.mp3",
        "예수님 한 줄 기차.mp3",
        "우리 함께 기뻐해.mp3",
        "잊지 마세요.mp3",
        "찬양이언제나넘치면.mp3",
        "하나님의책.mp3",
        "하나님저왔어요.mp3",
        "흰눈처럼양털처럼.mp3",
        "나는 예배자입니다.mp3",
        "내가 너와 함께 있어(창세기 28장 15절).mp3",
        "너와 나의 모습이.mp3",
        "따라따라 갈래요.mp3",
        "믿음으로 모든 세계가(히브리서11장3절상반절).mp3",
        "사도신경송.mp3",
        "생명 주께 있네.mp3",
        "주의 말씀은 내 발에 등이요(시편119편105절).mp3",
        "최고의 선물.mp3"
    ]
};
